In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('data/ai_job_dataset.csv')
df.head()

,job_id,job_title,salary_usd,salary_currency,experience_level,employment_type,company_location,company_size,employee_residence,remote_ratio,required_skills,education_required,years_experience,industry,posting_date,application_deadline,job_description_length,benefits_score,company_name
0,AI00001,AI Research Scientist,90376,USD,SE,CT,China,M,China,50,"Tableau, PyTorch, Kubernetes, Linux, NLP",Bachelor,9,Automotive,2024-10-18,2024-11-07,1076,5.9,Smart Analytics
1,AI00002,AI Software Engineer,61895,USD,EN,CT,Canada,M,Ireland,100,"Deep Learning, AWS, Mathematics, Python, Docker",Master,1,Media,2024-11-20,2025-01-11,1268,5.2,TechCorp Inc
2,AI00003,AI Specialist,152626,USD,MI,FL,Switzerland,L,South Korea,0,"Kubernetes, Deep Learning, Java, Hadoop, NLP",Associate,2,Education,2025-03-18,2025-04-07,1974,9.4,Autonomous Tech
3,AI00004,NLP Engineer,80215,USD,SE,FL,India,M,India,50,"Scala, SQL, Linux, Python",PhD,7,Consulting,2024-12-23,2025-02-24,1345,8.6,Future Systems
4,AI00005,AI Consultant,54624,EUR,EN,PT,France,S,Singapore,100,"MLOps, Java, Tableau, Python",Master,0,Media,2025-04-15,2025-06-23,1989,6.6,Advanced Robotics

In [7]:
print(df.shape)

(15000, 19)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15000 entries, 0 to 14999
Data columns (total 19 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   job_id                  15000 non-null  object
 1   job_title               15000 non-null  object
 2   salary_usd              15000 non-null  int64
 3   salary_currency         15000 non-null  object
 4   experience_level        15000 non-null  object
 5   employment_type         15000 non-null  object
 6   company_location        15000 non-null  object
 7   company_size            15000 non-null  object
 8   employee_residence      15000 non-null  object
 9   remote_ratio            15000 non-null  int64
 10  required_skills         15000 non-null  object
 11  education_required      15000 non-null  object
 12  years_experience        15000 non-null  int64
 13  industry                15000 non-null  object
 14  posting_date            15000 non-null  object
 15  application_deadline    15000 non-null  object
 16  job_description_length  15000 non-null  int64
 17  benefits_score          15000 non-null  float64
 18  company_name            15000 non-null  object
dtypes: float64(1), int64(4), object(14)
memory usage: 2.2+ MB

In [11]:
# Describing the dataset
df.describe().T

,count,mean,std,min,25%,50%,75%,max
salary_usd,15000.0,115348.965133,60260.940438,32519.0,70179.75,99705.0,146408.5,399095.0
remote_ratio,15000.0,49.483333,40.812712,0.0,0.00,50.0,100.0,100.0
years_experience,15000.0,6.253200,5.545768,0.0,2.00,5.0,10.0,19.0
job_description_length,15000.0,1503.314733,576.127083,500.0,1003.75,1512.0,2000.0,2499.0
benefits_score,15000.0,7.504273,1.450870,5.0,6.20,7.5,8.8,10.0

In [ ]:
df.isna().mean().sort_values(ascending=False).head(20)

job_id                    0.0
required_skills           0.0
benefits_score            0.0
job_description_length    0.0
application_deadline      0.0
posting_date              0.0
industry                  0.0
years_experience          0.0
education_required        0.0
remote_ratio              0.0
job_title                 0.0
employee_residence        0.0
company_size              0.0
company_location          0.0
employment_type           0.0
experience_level          0.0
salary_currency           0.0
salary_usd                0.0
company_name              0.0
dtype: float64

In [ ]:
# check for missing values
df.isnull().sum()>0

job_id                    False
job_title                 False
salary_usd                False
salary_currency           False
experience_level          False
employment_type           False
company_location          False
company_size              False
employee_residence        False
remote_ratio              False
required_skills           False
education_required        False
years_experience          False
industry                  False
posting_date              False
application_deadline      False
job_description_length    False
benefits_score            False
company_name              False
dtype: bool

In [12]:
target = 'salary_in_usd'

In [ ]:
# don't need the id column
df = df[list(df.columns)[1:]]

In [24]:
cat_columns = df.select_dtypes(include=['object']).columns.tolist()
cat_columns = [cols for cols in cat_columns if cols != target]
cat_columns

['salary_currency',
 'experience_level',
 'employment_type',
 'company_location',
 'company_size',
 'employee_residence',
 'required_skills',
 'education_required',
 'industry',
 'posting_date',
 'application_deadline',
 'company_name']

In [ ]:
# Ð¡heck unique values of categorical columns
for cols in cat_columns:
    print(cols)
    print(df[cols].value_counts())
    print()

salary_currency
salary_currency
USD    11957
EUR     2314
GBP      729
Name: count, dtype: int64

experience_level
experience_level
MI    3781
EX    3760
SE    3741
EN    3718
Name: count, dtype: int64

employment_type
employment_type
FT    3812
FL    3758
CT    3721
PT    3709
Name: count, dtype: int64

company_location
company_location
Germany           814
Denmark           778
France            769
Canada            769
Austria           765
Singapore         764
China             763
India             754
Sweden            752
Israel            751
Ireland           750
Switzerland       746
Finland           733
Japan             733
Australia         732
Netherlands       731
United Kingdom    729
United States     724
South Korea       722
Norway            721
Name: count, dtype: int64

company_size
company_size
S    5007
L    4998
M    4995
Name: count, dtype: int64

employee_residence
employee_residence
Sweden            790
France            781
Denmark           777
Austria           776
India             772
Germany           769
South Korea       763
Canada            762
China             761
Netherlands       758
United Kingdom    750
Switzerland       748
Singapore         740
Ireland           740
Israel            731
Australia         730
Norway            726
United States     716
Finland           710
Japan             700
Name: count, dtype: int64

required_skills
required_skills
Python, TensorFlow, PyTorch                            17
Python, TensorFlow, Tableau                             9
Python, TensorFlow, MLOps                               7
Python, TensorFlow, Data Visualization                  7
Python, TensorFlow, Linux                               7
                                                       ..
Mathematics, Git, Spark                                 1
TensorFlow, SQL, NLP, Python, Scala                     1
Kubernetes, Statistics, Scala, GCP, Computer Vision     1
Scala, Kubernetes, MLOps, Python, Azure                 1
Scala, Azure, Deep Learning, GCP, Mathematics           1
Name: count, Length: 13663, dtype: int64

education_required
education_required
Bachelor     3789
Associate    3785
Master       3748
PhD          3678
Name: count, dtype: int64

industry
industry
Retail                1063
Media                 1045
Automotive            1020
Consulting            1020
Technology            1011
Real Estate           1007
Government             998
Healthcare             997
Telecommunications     997
Transportation         997
Finance                984
Energy                 976
Gaming                 967
Manufacturing          962
Education              956
Name: count, dtype: int64

posting_date
posting_date
2024-07-05    51
2024-04-08    51
2024-08-25    49
2025-04-05    46
2024-03-01    44
              ..
2025-03-24    19
2025-03-12    18
2024-02-10    18
2024-09-15    15
2024-12-19    14
Name: count, Length: 486, dtype: int64

application_deadline
application_deadline
2025-01-05    47
2024-12-28    46
2025-04-07    45
2025-01-04    44
2024-08-27    44
              ..
2024-01-23     2
2024-01-21     1
2025-07-11     1
2024-01-16     1
2025-07-07     1
Name: count, Length: 543, dtype: int64

company_name
company_name
TechCorp Inc                  980
Cognitive Computing           972
AI Innovations                964
Digital Transformation LLC    961
Future Systems                960
Quantum Computing Inc         960
Cloud AI Solutions            951
Predictive Systems            947
Smart Analytics               927
Advanced Robotics             925
Neural Networks Co            922
Machine Intelligence Group    922
Autonomous Tech               918
DataVision Ltd                909
DeepTech Ventures             897
Algorithmic Solutions         885
Name: count, dtype: int64

In [26]:
df.columns.tolist()

['salary_usd',
 'salary_currency',
 'experience_level',
 'employment_type',
 'company_location',
 'company_size',
 'employee_residence',
 'remote_ratio',
 'required_skills',
 'education_required',
 'years_experience',
 'industry',
 'posting_date',
 'application_deadline',
 'job_description_length',
 'benefits_score',
 'company_name']